<div class="alert alert-block alert-info">
    <h2 align="center">US Presidents</h2>
    <h4 align="center"><a href="https://t.me/afsharino">Mohammad Afshari</a></h4>
</div>

<style>
.aligncenter {
    text-align: center;
}
</style>
<p class="aligncenter">
    <img src = "../images/us-prsidents.jpg"  width=70%>
</p>

# Import Libraries

In [1]:
# Scientific
import pandas as pd
import numpy as np

# Load Dataset

In [3]:
data = pd.read_csv('../dataset/president_heights.csv',index_col=False)

# Inspect the Data

In [4]:
data.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       44 non-null     int64
 1   name        44 non-null     object
 2   height(cm)  44 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

In [6]:
data.describe()

           order  height(cm)
count  44.000000   44.000000
mean   23.522727  180.045455
std    13.729087    7.064337
min     1.000000  163.000000
25%    11.750000  174.750000
50%    24.000000  182.000000
75%    35.250000  183.500000
max    46.000000  193.000000

## 01. Presidents with height lower than 180 cm.

In [7]:
data[data['height(cm)'] < 180][['name']]

                      name
1               John Adams
3            James Madison
5        John Quincy Adams
7         Martin Van Buren
8   William Henry Harrison
10           James K. Polk
11          Zachary Taylor
12        Millard Fillmore
13         Franklin Pierce
16          Andrew Johnson
17        Ulysses S. Grant
18     Rutherford B. Hayes
21       Benjamin Harrison
22        William McKinley
23      Theodore Roosevelt
27         Calvin Coolidge
30         Harry S. Truman
31    Dwight D. Eisenhower
36            Jimmy Carter

## 02. Rosvelt height?

In [8]:
names = [str(data[data['name']==name]['name']).split('\n')[0].split('    ')[1] for name in data.name if 'Roosevelt' in name]
pd.concat([data[names[0]== data['name']] , data[names[1]== data['name']]])

    order                   name  height(cm)
23     26     Theodore Roosevelt         178
29     32  Franklin D. Roosevelt         188

## 03. The tallest president?

In [9]:
data.loc[data['height(cm)'] == data['height(cm)'].max()]

    order               name  height(cm)
15     16    Abraham Lincoln         193
33     36  Lyndon B. Johnson         193

## 04. The time of being president

In [11]:
data[data['height(cm)'] == data['height(cm)'].max()][['name','order']]

                 name  order
15    Abraham Lincoln     16
33  Lyndon B. Johnson     36